cask_args appdir: "/Applications"

# Taps
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"

# brew
brew "cloc"
brew "wget"
brew "node"
brew "pnpm"
brew "tmux"
brew "gh"
brew "neovim"
brew "tree-sitter"
brew "mysql"

# Apps
cask "alfred"
cask "clashx"
cask "iterm2"
cask "qingg"
cask "google-chrome"
cask "visual-studio-code"
cask "the-unarchiver"
cask "qq"
cask "wechat"

# Fonts
cask "font-fira-mono-nerd-font"
