cask_args appdir: "/Applications"

# Taps
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"

# brew
brew "aria2"
brew "cloc"
brew "wget"
brew "node"
brew "yarn"
brew "tmux"
brew "dockutil"
brew "webp"
brew "pandoc"
brew "go"
brew "gh"
brew "postgresql"
brew "neovim"
brew "tree-sitter"
brew "ffmpeg"
brew "imagemagick"

# Apps
cask "alfred"
cask "clashx"
cask "google-chrome"
cask "iterm2"
cask "iina"
cask "qingg"
cask "visual-studio-code"
cask "the-unarchiver"
cask "qq"
cask "wechat"

# Fonts
