cask_args appdir: "/Applications"

# Taps
<<<<<<< HEAD
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"

# brew
brew "cloc"
brew "wget"
brew "node"
brew "pnpm"
brew "tmux"
brew "gh"
brew "neovim"
brew "tree-sitter"
brew "mysql"

# Apps
cask "alfred"
cask "clashx"
cask "iterm2"
cask "qingg"
cask "google-chrome"
cask "visual-studio-code"
cask "the-unarchiver"
cask "qq"
cask "wechat"

# Fonts
cask "font-fira-mono-nerd-font"
=======
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/services"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"

# Formulae
brew "cloc"
brew "gh"
brew "neovim"
brew "node"
brew "pnpm"
brew "rust"
brew "tmux"
brew "wget"
brew "ripgrep"
brew "lua-language-server"

# Apps
cask "clashx"
cask "alacritty"
cask "qingg"
cask "visual-studio-code"
cask "qq"
cask "wechat"
cask "iina"

# Fonts
cask "font-sf-mono"
cask "font-symbols-only-nerd-font"
cask "font-jetbrains-mono-nerd-font"
>>>>>>> develop
