tap "carlocab/personal"
tap "homebrew/bundle"
tap "homebrew/services"
tap "majd/repo"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# High performance key/value database
brew "berkeley-db"
# X.Org: Core X11 protocol client library
brew "libx11"
# GNU compiler collection
brew "gcc"
# OpenType text shaping engine
brew "harfbuzz"
# Optimized BLAS library
brew "openblas"
# Package for scientific computing with Python
brew "numpy"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Tool Command Language
brew "tcl-tk"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# New way to see and navigate directory trees
brew "broot"
# Scriptable network and serial communication for UNIX and VMS
brew "c-kermit"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Make choices on the command-line
brew "choose"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Power of curl, ease of use of httpie
brew "curlie"
# Command-line DNS client
brew "dog"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Brokered message queue optimized for performance
brew "fq"
# Command-line fuzzy finder written in Go
brew "fzf"
# Library for encoding and decoding .avif files
brew "libavif"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Perfect hash function generator
brew "gperf"
# Ping, but with a graph
brew "gping"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Platform built on V8 to build network applications
brew "node", link: false
# System monitoring dashboard for terminal
brew "gtop"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Development kit for the Java programming language
brew "openjdk"
# Centralized server for distributed coordination of services
brew "zookeeper", restart_service: true
# Open-source distributed event streaming platform
brew "kafka"
# Asynchronous event library
brew "libevent"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Apache Kafka C/C++ library
brew "librdkafka"
# Extended crypt library for descrypt, md5crypt, bcrypt, and others
brew "libxcrypt"
# Tools for zmodem/xmodem/ymodem file transfer
brew "lrzsz"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Fly through your shell history
brew "mcfly"
# Show markdown documents on text terminals
brew "mdcat"
# Open source relational database management system
brew "mysql"
# Port scanning utility for large networks
brew "nmap"
# Command-line Git information tool
brew "onefetch"
# Manage compile and link flags for libraries
brew "pkg-config"
# Modern replacement for ps written by Rust
brew "procs"
# Show ps output as a tree
brew "pstree"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# SOcket CAT: netcat on steroids
brew "socat"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Extract, view, and test RAR archives
brew "carlocab/personal/unrar"
# Function key control
cask "functionflip"
# CLI tool for searching and downloading iOS app packages from the App Store
cask "ipatool"
